In [114]:
import pandas as pd 

df = pd.DataFrame({
    'name': ["alice", "bob", "charlie", "david", "eva"],
    'age': [24, 27, 22, 32, 29],
    'city': ["new york", "los angeles", "chicago", "houston", "phoenix"]
})

df.head(2)

    name  age         city
0  alice   24     new york
1    bob   27  los angeles

In [115]:
df['salary'] = [50_000, 60_000, 45_000, 70_000,  75_000]
print(df['salary'].to_list(), end="\n\n")
print(df.head())

[50000, 60000, 45000, 70000, 75000]

      name  age         city  salary
0    alice   24     new york   50000
1      bob   27  los angeles   60000
2  charlie   22      chicago   45000
3    david   32      houston   70000
4      eva   29      phoenix   75000

In [116]:
df2 = pd.DataFrame({
    'name': ["alice", "bob", "charlie", "david", "eva"],
    "cats": [0, 1, 2, 0, 5]
})

df3 = pd.merge(df, df2, on="name")
df3

      name  age         city  salary  cats
0    alice   24     new york   50000     0
1      bob   27  los angeles   60000     1
2  charlie   22      chicago   45000     2
3    david   32      houston   70000     0
4      eva   29      phoenix   75000     5

In [117]:
df['age cat'] = df['age'].apply(lambda x: 'young' if x < 25 else 'adult')
df

      name  age         city  salary age cat
0    alice   24     new york   50000   young
1      bob   27  los angeles   60000   adult
2  charlie   22      chicago   45000   young
3    david   32      houston   70000   adult
4      eva   29      phoenix   75000   adult

In [118]:
dropped = df.drop(columns=["city"])
dropped

      name  age  salary age cat
0    alice   24   50000   young
1      bob   27   60000   adult
2  charlie   22   45000   young
3    david   32   70000   adult
4      eva   29   75000   adult